#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет график работы за указанный период в днях
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.BKM_ГрафикиРабот.СоздатьНаборЗаписей();	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ДатаЗаписи = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда			
			Продолжить;			
		ИначеЕсли Запись.Дата = ДатаЗаписи Тогда			
			Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаЗаписи))) Тогда
				Запись.Значение = 0;
			Иначе	          
				Запись.Значение = 8;
			КонецЕсли;
			ДатаЗаписи = ДатаЗаписи + ЧислоСекундВСутках;			
		Иначе			
			Пока ДатаЗаписи < Мин(Запись.Дата, ДатаОкончания) Цикл			
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = ДатаЗаписи;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаЗаписи))) Тогда
					НоваяЗапись.Значение = 0;
				Иначе	          
					НоваяЗапись.Значение = 8;
				КонецЕсли; 
				ДатаЗаписи = ДатаЗаписи + ЧислоСекундВСутках;				
			КонецЦикла;
			
			Если Запись.Дата > ДатаОкончания Тогда			
				Прервать;				
			Иначе				
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаЗаписи))) Тогда
					Запись.Значение = 0;
				Иначе	          
					Запись.Значение = 8;
				КонецЕсли;
			КонецЕсли;
			ДатаЗаписи = ДатаЗаписи + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока ДатаЗаписи <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = ДатаЗаписи;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаЗаписи))) Тогда
			Запись.Значение = 0;
		Иначе	          
			Запись.Значение = 8;
		КонецЕсли; 
		ДатаЗаписи = ДатаЗаписи + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли