#language: ru

@tree

Функционал: <описание фичи>

Я хочу
Проверить данные Отчета 'Анализ выставленных актов'
чтобы данные сходились с приложенным файлом 

Контекст:
	Дано я открыл сеанс TestClient от имени "Бухгалтер" с паролем "" или подключаю уже существующий
Сценарий: Сравнение отчёта 'Анализ выставленных актов' с эталоном за февраль 2026 года
  И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Анализ выставленных актов'
  Тогда открылось окно 'Анализ выставленных актов'
  И я нажимаю кнопку выбора у поля с именем "Период1ДатаНачала"
  И в поле с именем "Период1ДатаНачала" я ввожу текст "01.02.2026"
  И я нажимаю кнопку выбора у поля с именем "Период1ДатаОкончания"
  И в поле с именем "Период1ДатаОкончания" я ввожу текст "28.02.2026"
  И я нажимаю на кнопку с именем "СформироватьОтчет"
  *Сравнение с макетом "Февраль.mxl"
  Если табличный документ "ОтчетТабличныйДокумент" равен макету "Февраль.mxl" тогда
  И я закрываю окно "Анализ выставленных актов"

Сценарий: Сравнение отчёта 'Анализ выставленных актов' с эталоном за октябрь 2026 года
  И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Анализ выставленных актов'
  Тогда открылось окно 'Анализ выставленных актов'
  И я нажимаю кнопку выбора у поля с именем "Период1ДатаНачала"
  И в поле с именем "Период1ДатаНачала" я ввожу текст "01.10.2026"
  И я нажимаю кнопку выбора у поля с именем "Период1ДатаОкончания"
  И в поле с именем "Период1ДатаОкончания" я ввожу текст "31.10.2026"
  И я нажимаю на кнопку с именем "СформироватьОтчет"
  *Сравнение с макетом "Октябрь.mxl"
  Если табличный документ "ОтчетТабличныйДокумент" равен макету "Октябрь.mxl" тогда
  И я закрываю окно "Анализ выставленных актов"
