#language: ru

@tree

Функционал: Массовое создание актов с ролью бухгалтер.

Я хочу создать разом документы "Реализация товаров и услуг" за определенный период 

Контекст:
	Дано я открыл сеанс TestClient от имени "Бухгалтер" с паролем "" или подключаю уже существующий
	И я закрываю все окна клиентского приложения
	
Сценарий: Массовое создание актов за месяц
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Массовое создание актов'
Тогда открылось окно 'Массовое создание актов'
И я нажимаю кнопку выбора у поля с именем "Период"
Тогда открылось окно 'Выберите период'
И в поле с именем 'DateBegin' я ввожу текст '01.04.2026'
И в поле с именем 'DateEnd' я ввожу текст '30.04.2026'
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно 'Массовое создание актов'
И я нажимаю на кнопку с именем 'СоздатьДокументы'
И Я закрываю окно 'Массовое создание актов'
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Реализации товаров и услуг'
Тогда открылось окно 'Реализации товаров и услуг'
*Реализация 1 - АгроСоюз ООО
И в таблице "Список" я перехожу к строке:
	| 'Дата'                | 'Договор'          | 'Комментарий'                    		  | 'Контрагент'   |  'Организация' 	   | 'Ответственный' | 'Сумма документа' |
	| '30.04.2026 23:59:59' | 'Основной договор' | 'Документ создан обработкой автоматически' | 'АгроСоюз ООО' |  'Логика Сервис ООО'  | 'Бухгалтер'     | '2 500,00'        |
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Реализация товаров и услуг * от *'
И Я закрываю окно 'Реализация товаров и услуг * от *'


