#language: ru

@tree

Функционал: Создание документа "Обслуживание клиента" с ролью Менеджер по обслуживанию.

Я хочу создать автоматические документы "Обслуживание клиента" и проверить функционал заполнения

Контекст:
	Дано я открыл сеанс TestClient от имени "Менеджер по обслуживанию" с паролем "" или подключаю уже существующий
	И я закрываю все окна клиентского приложения	
Сценарий: Создание Документа Обслуживание клиента Специалист Дмитриев Юрий Анатольевич, 05.03.2026 с 08 по 12
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
Если таблица  "Обслуживание клиентов" не содержит строки: Тогда
	| 'Время начала работ (план)' | 'Время окончания работ (план)' |  'Дата проведения работ' | 'Клиент'        |  'Договор'            |  'Специалист'     		   | 
	| '08.00'                     | '12.00'                        |  '06.03.2026'            | 'ДЛ-ТРАНС ООО'  |  'Основной договор'	|  'Дмитриев Юрий Анатольевич' | 

*Создание Обслуживание клиента 1
	И я нажимаю на кнопку с именем 'ФормаСоздать' 
	Тогда открылось окно 'Обслуживание клиента (создание)'
	*Заполнение Дата
	И в поле с именем 'Дата' я ввожу текст '05.03.2026
	И я перехожу к следующему реквизиту	
	*Заполнение Клиента
	И я нажимаю кнопку выбора у поля с именем "Клиент"
	Тогда открылось окно 'Контрагенты'
	Если таблица  "Список" не содержит строки: Тогда
		| 'Наименование' 			 |
		| 'Абонентское обслуживание' |
		И я нажимаю на кнопку с именем 'ФормаСоздатьГруппу'
		Тогда открылось окно 'Контрагенты (создание группы)'
		И в поле с именем 'Наименование' я ввожу текст 'Абонентское обслуживание'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Контрагенты (создание группы) *' в течение 20 секунд
		Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я перехожу к строке
			| 'Наименование' 			 |
			| 'Абонентское обслуживание' |
	И в таблице  "Список" я перехожу на один уровень вниз
	Если таблица  "Контрагенты" не содержит строки: Тогда
		| 'Наименование' 	|
		| 'ДЛ-ТРАНС ООО' 	|
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Контрагент (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'ДЛ-ТРАНС ООО'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Контрагент (создание) *' в течение 20 секунд
		Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я перехожу к строке
			| 'Наименование'	|
			| 'ДЛ-ТРАНС ООО' 	|	
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	*Заполнение Договора контрагента
	И я нажимаю кнопку выбора у поля с именем "Договор"
	Тогда открылось окно 'Договоры контрагентов'
	Если таблица  "Список" не содержит строки: Тогда
		| 'Наименование' 	 |
		| 'Основной договор' |
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Договор контрагента (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Основной договор'
		И я нажимаю кнопку выбора у поля с именем  "Контрагент"
		И в таблице "Контрагенты" я перехожу к строке
			| 'Наименование' |
			| 'ДЛ-ТРАНС ООО' |	
		И в таблице "Список" я выбираю текущую строку	
		Тогда открылось окно 'Договор контрагента (создание)*'			
		И я нажимаю кнопку выбора у поля с именем "Организация"
		Тогда открылось окно 'Организации'
		Если таблица  "Список" не содержит строки: Тогда
			| 'Наименование' |
			| 'Логика Сервис ООО' |
			И я нажимаю на кнопку с именем 'ФормаСоздать'
			Тогда открылось окно 'Организация (создание)'
			И в поле с именем 'Наименование' я ввожу текст 'Логика Сервис ООО'
			И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
			И я жду закрытия окна 'Организация (создание) *' в течение 20 секунд
			Тогда открылось окно 'Организации'		
		И в таблице "Организации" я перехожу к строке
			| 'Наименование' |
			| 'Логика Сервис ООО' |	
		И в таблице "Список" я выбираю текущую строку	
		Тогда открылось окно 'Договор контрагента (создание)*'
		И из выпадающего списка с именем "ВидДоговора" я выбираю точное значение 'Абонентское обслуживание'
		И в поле с именем 'АбонентскаяПлата' я ввожу текст '3 000,00'
		И в поле с именем 'СтоимостьЧасаРаботы' я ввожу текст '1 200,00'
		И я нажимаю кнопку выбора у поля с именем "ПериодДействияДоговора"
		Тогда открылось окно 'Выберите период'
		И в поле с именем 'ДатаНачала' я ввожу текст '01.01.2026'
		И я нажимаю кнопку выбора у поля с именем "ПериодДействияДоговора"
		И в поле с именем 'ДатаОкончания' я ввожу текст '31.12.2027'
		И я нажимаю на кнопку с именем 'ПериодДействияДоговора'	
		Тогда открылось окно 'Договор контрагента (создание)*'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Договор контрагента (создание)*' в течение 20 секунд
		Тогда открылось окно 'Договоры контрагентов'
	И в таблице "Список" я перехожу к строке
		| 'Наименование' 	 |
		| 'Основной договор' |	
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	*Заполнение ДатаПроведенияРабот
	И в поле с именем 'ДатаПроведенияРабот' я ввожу текст '06.03.2026
	И я перехожу к следующему реквизиту	
	*Заполнение ВремяНачалаРабот'
	И в поле с именем 'ВремяНачалаРабот' я ввожу текст '08.00'
	И я перехожу к следующему реквизиту
	*Заполнение ВремяОкончанияРабот
	И в поле с именем 'ВремяОкончанияРабот' я ввожу текст '12.00'
	И я перехожу к следующему реквизиту
	*Заполнение Специалиста
	И я нажимаю кнопку выбора у поля с именем "Специалист"
	Тогда открылось окно 'Сотрудники'
	Если таблица  "Сотрудники" не содержит строки: Тогда
		| 'Наименование' 	 		  |
		| 'Дмитриев Юрий Анатольевич' |
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Сотрудник (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Дмитриев Юрий Анатольевич'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Сотрудник (создание) *' в течение 20 секунд
		Тогда открылось окно 'Сотрудники'
	И в таблице "Список" я перехожу к строке:
		| 'Наименование'        	  |
		| 'Дмитриев Юрий Анатольевич' |
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	И в поле с именем 'ОписаниеПроблемы' я ввожу текст 'Абонентское обслуживание клиента ДЛ-ТРАНС ООО'
	И в поле с именем 'Комментарий' я ввожу текст 'Документ создан тестированием VannessaAutomation.'
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна 'Обслуживание клиента (создание)*' в течение 20 секунд
	Тогда открылось окно 'Обслуживание клиентов'	

И в таблице "Список" я перехожу к строке
	| 'Время начала работ (план)' | 'Время окончания работ (план)' |  'Дата проведения работ' | 'Клиент'         | 'Договор'          |  'Специалист'     			 |
	| '08.00'                     | '12.00'                        |  '06.03.2026'            | 'ДЛ-ТРАНС ООО'	 | 'Основной договор' |  'Дмитриев Юрий Анатольевич' |


Контекст:	И я закрываю все окна клиентского приложения

Сценарий: Создание Документа Обслуживание клиента Специалист Штиллер Юлия Андреевна, 06.03.2026 с 10 по 12
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
Если таблица  "Обслуживание клиентов" не содержит строки: Тогда
	| 'Время начала работ (план)' | 'Время окончания работ (план)' |  'Дата проведения работ' | 'Клиент'        |  'Договор'            |  'Специалист'     		| 
	| '10.00'                     | '12.00'                        |  '07.03.2026'            | 'АгроСоюз ООО'  |  'Основной договор'	|  'Штиллер Юлия Андреевна' | 

*Создание Обслуживание клиента 2
	И я нажимаю на кнопку с именем 'ФормаСоздать' 
	Тогда открылось окно 'Обслуживание клиента (создание)'
	*Заполнение Дата
	И в поле с именем 'Дата' я ввожу текст '06.03.2026
	И я перехожу к следующему реквизиту	
	*Заполнение Клиента
	И я нажимаю кнопку выбора у поля с именем "Клиент"
	Тогда открылось окно 'Контрагенты'
	Если таблица  "Список" не содержит строки: Тогда
		| 'Наименование' 			 |
		| 'Абонентское обслуживание' |
		И я нажимаю на кнопку с именем 'ФормаСоздатьГруппу'
		Тогда открылось окно 'Контрагенты (создание группы)'
		И в поле с именем 'Наименование' я ввожу текст 'Абонентское обслуживание'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Контрагенты (создание группы) *' в течение 20 секунд
		Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я перехожу к строке
			| 'Наименование' 			 |
			| 'Абонентское обслуживание' |
	И в таблице  "Список" я перехожу на один уровень вниз
	Если таблица  "Контрагенты" не содержит строки: Тогда
		| 'Наименование' 	|
		| 'АгроСоюз ООО' 	|
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Контрагент (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'АгроСоюз ООО'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Контрагент (создание) *' в течение 20 секунд
		Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я перехожу к строке
			| 'Наименование'	|
			| 'АгроСоюз ООО' 	|	
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	*Заполнение Договора контрагента
	И я нажимаю кнопку выбора у поля с именем "Договор"
	Тогда открылось окно 'Договоры контрагентов'
	Если таблица  "Список" не содержит строки: Тогда
		| 'Наименование' 	 |
		| 'Основной договор' |
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Договор контрагента (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Основной договор'
		И я нажимаю кнопку выбора у поля с именем  "Контрагент"
		И в таблице "Контрагенты" я перехожу к строке
			| 'Наименование' |
			| 'АгроСоюз ООО' |	
		И в таблице "Список" я выбираю текущую строку	
		Тогда открылось окно 'Договор контрагента (создание)*'			
		И я нажимаю кнопку выбора у поля с именем "Организация"
		Тогда открылось окно 'Организации'
		Если таблица  "Список" не содержит строки: Тогда
			| 'Наименование' |
			| 'Логика Сервис ООО' |
			И я нажимаю на кнопку с именем 'ФормаСоздать'
			Тогда открылось окно 'Организация (создание)'
			И в поле с именем 'Наименование' я ввожу текст 'Логика Сервис ООО'
			И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
			И я жду закрытия окна 'Организация (создание) *' в течение 20 секунд
			Тогда открылось окно 'Организации'		
		И в таблице "Организации" я перехожу к строке
			| 'Наименование' |
			| 'Логика Сервис ООО' |	
		И в таблице "Список" я выбираю текущую строку	
		Тогда открылось окно 'Договор контрагента (создание)*'
		И из выпадающего списка с именем "ВидДоговора" я выбираю точное значение 'Абонентское обслуживание'
		И в поле с именем 'АбонентскаяПлата' я ввожу текст '2 500,00'
		И в поле с именем 'СтоимостьЧасаРаботы' я ввожу текст '1 000,00'
		И я нажимаю кнопку выбора у поля с именем "ПериодДействияДоговора"
		Тогда открылось окно 'Выберите период'
		И в поле с именем 'ДатаНачала' я ввожу текст '01.01.2026'
		И я нажимаю кнопку выбора у поля с именем "ПериодДействияДоговора"
		И в поле с именем 'ДатаОкончания' я ввожу текст '31.12.2027'
		И я нажимаю на кнопку с именем 'ПериодДействияДоговора'	
		Тогда открылось окно 'Договор контрагента (создание)*'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Договор контрагента (создание)*' в течение 20 секунд
		Тогда открылось окно 'Договоры контрагентов'
	И в таблице "Список" я перехожу к строке
		| 'Наименование' 	 |
		| 'Основной договор' |	
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	*Заполнение ДатаПроведенияРабот
	И в поле с именем 'ДатаПроведенияРабот' я ввожу текст '07.03.2026
	И я перехожу к следующему реквизиту	
	*Заполнение ВремяНачалаРабот'
	И в поле с именем 'ВремяНачалаРабот' я ввожу текст '10.00'
	И я перехожу к следующему реквизиту
	*Заполнение ВремяОкончанияРабот
	И в поле с именем 'ВремяОкончанияРабот' я ввожу текст '12.00'
	И я перехожу к следующему реквизиту
	*Заполнение Специалиста
	И я нажимаю кнопку выбора у поля с именем "Специалист"
	Тогда открылось окно 'Сотрудники'
	Если таблица  "Сотрудники" не содержит строки: Тогда
		| 'Наименование' 	 	   |
		| 'Штиллер Юлия Андреевна' |
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Сотрудник (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Штиллер Юлия Андреевна'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Сотрудник (создание) *' в течение 20 секунд
		Тогда открылось окно 'Сотрудники'
	И в таблице "Список" я перехожу к строке:
		| 'Наименование'           |
		| 'Штиллер Юлия Андреевна' |
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	И в поле с именем 'ОписаниеПроблемы' я ввожу текст 'Абонентское обслуживание клиента АгроСоюз ООО'
	И в поле с именем 'Комментарий' я ввожу текст 'Документ создан тестированием VannessaAutomation.'
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна 'Обслуживание клиента (создание)*' в течение 20 секунд
	Тогда открылось окно 'Обслуживание клиентов'	

И в таблице "Список" я перехожу к строке
	| 'Время начала работ (план)' | 'Время окончания работ (план)' |  'Дата проведения работ' | 'Клиент'         | 'Договор'          |  'Специалист'     			 |
	| '10.00'                     | '12.00'                        |  '07.03.2026'            | 'АгроСоюз ООО'	 | 'Основной договор' |  'Штиллер Юлия Андреевна'	 |


Контекст:	И я закрываю все окна клиентского приложения

Сценарий: Создание Документа Обслуживание клиента Специалист Егорова Ирина Анатольевна, 07.03.2026 с 11 по 16
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
Если таблица  "Обслуживание клиентов" не содержит строки: Тогда
	| 'Время начала работ (план)' | 'Время окончания работ (план)' |  'Дата проведения работ' | 'Клиент'         |  'Договор'            |  'Специалист'     			| 
	| '11.00'                     | '16.00'                        |  '08.03.2026'            | 'ЮГОРИЯ ГСК АО'  |  'Основной договор'	 |  'Егорова Ирина Анатольевна' | 

*Создание Обслуживание клиента 3
	И я нажимаю на кнопку с именем 'ФормаСоздать' 
	Тогда открылось окно 'Обслуживание клиента (создание)'
	*Заполнение Дата
	И в поле с именем 'Дата' я ввожу текст '07.03.2026
	И я перехожу к следующему реквизиту	
	*Заполнение Клиента
	И я нажимаю кнопку выбора у поля с именем "Клиент"
	Тогда открылось окно 'Контрагенты'
	Если таблица  "Список" не содержит строки: Тогда
		| 'Наименование' 			 |
		| 'Абонентское обслуживание' |
		И я нажимаю на кнопку с именем 'ФормаСоздатьГруппу'
		Тогда открылось окно 'Контрагенты (создание группы)'
		И в поле с именем 'Наименование' я ввожу текст 'Абонентское обслуживание'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Контрагенты (создание группы) *' в течение 20 секунд
		Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я перехожу к строке
			| 'Наименование' 			 |
			| 'Абонентское обслуживание' |
	И в таблице  "Список" я перехожу на один уровень вниз
	Если таблица  "Контрагенты" не содержит строки: Тогда
		| 'Наименование' 	|
		| 'ЮГОРИЯ ГСК АО' 	|
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Контрагент (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'ЮГОРИЯ ГСК АО'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Контрагент (создание) *' в течение 20 секунд
		Тогда открылось окно 'Контрагенты'
	И в таблице "Список" я перехожу к строке
			| 'Наименование'	|
			| 'ЮГОРИЯ ГСК АО' 	|	
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	*Заполнение Договора контрагента
	И я нажимаю кнопку выбора у поля с именем "Договор"
	Тогда открылось окно 'Договоры контрагентов'
	Если таблица  "Список" не содержит строки: Тогда
		| 'Наименование' 	 |
		| 'Основной договор' |
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Договор контрагента (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Основной договор'
		И я нажимаю кнопку выбора у поля с именем  "Контрагент"
		И в таблице "Контрагенты" я перехожу к строке
			| 'Наименование' |
			| 'ЮГОРИЯ ГСК АО' |	
		И в таблице "Список" я выбираю текущую строку	
		Тогда открылось окно 'Договор контрагента (создание)*'			
		И я нажимаю кнопку выбора у поля с именем "Организация"
		Тогда открылось окно 'Организации'
		Если таблица  "Список" не содержит строки: Тогда
			| 'Наименование' |
			| 'Логика Сервис ООО' |
			И я нажимаю на кнопку с именем 'ФормаСоздать'
			Тогда открылось окно 'Организация (создание)'
			И в поле с именем 'Наименование' я ввожу текст 'Логика Сервис ООО'
			И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
			И я жду закрытия окна 'Организация (создание) *' в течение 20 секунд
			Тогда открылось окно 'Организации'		
		И в таблице "Организации" я перехожу к строке
			| 'Наименование' |
			| 'Логика Сервис ООО' |	
		И в таблице "Список" я выбираю текущую строку	
		Тогда открылось окно 'Договор контрагента (создание)*'
		И из выпадающего списка с именем "ВидДоговора" я выбираю точное значение 'Абонентское обслуживание'
		И в поле с именем 'АбонентскаяПлата' я ввожу текст '1 000,00'
		И в поле с именем 'СтоимостьЧасаРаботы' я ввожу текст '500,00'
		И я нажимаю кнопку выбора у поля с именем "ПериодДействияДоговора"
		Тогда открылось окно 'Выберите период'
		И в поле с именем 'ДатаНачала' я ввожу текст '01.01.2026'
		И я нажимаю кнопку выбора у поля с именем "ПериодДействияДоговора"
		И в поле с именем 'ДатаОкончания' я ввожу текст '31.12.2026'
		И я нажимаю на кнопку с именем 'ПериодДействияДоговора'	
		Тогда открылось окно 'Договор контрагента (создание)*'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Договор контрагента (создание)*' в течение 20 секунд
		Тогда открылось окно 'Договоры контрагентов'
	И в таблице "Список" я перехожу к строке
		| 'Наименование' 	 |
		| 'Основной договор' |	
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	*Заполнение ДатаПроведенияРабот
	И в поле с именем 'ДатаПроведенияРабот' я ввожу текст '07.03.2026
	И я перехожу к следующему реквизиту	
	*Заполнение ВремяНачалаРабот'
	И в поле с именем 'ВремяНачалаРабот' я ввожу текст '11.00'
	И я перехожу к следующему реквизиту
	*Заполнение ВремяОкончанияРабот
	И в поле с именем 'ВремяОкончанияРабот' я ввожу текст '16.00'
	И я перехожу к следующему реквизиту
	*Заполнение Специалиста
	И я нажимаю кнопку выбора у поля с именем "Специалист"
	Тогда открылось окно 'Сотрудники'
	Если таблица  "Сотрудники" не содержит строки: Тогда
		| 'Наименование' 	 	   |
		| 'Егорова Ирина Анатольевна' |
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Сотрудник (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Егорова Ирина Анатольевна'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Сотрудник (создание) *' в течение 20 секунд
		Тогда открылось окно 'Сотрудники'
	И в таблице "Список" я перехожу к строке:
		| 'Наименование'           |
		| 'Егорова Ирина Анатольевна' |
	И в таблице "Список" я выбираю текущую строку
	И я перехожу к следующему реквизиту
	И в поле с именем 'ОписаниеПроблемы' я ввожу текст 'Абонентское обслуживание клиента ЮГОРИЯ ГСК АО'
	И в поле с именем 'Комментарий' я ввожу текст 'Документ создан тестированием VannessaAutomation'
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна 'Обслуживание клиента (создание)*' в течение 20 секунд
	Тогда открылось окно 'Обслуживание клиентов'	

И в таблице "Список" я перехожу к строке
	| 'Время начала работ (план)' | 'Время окончания работ (план)' |  'Дата проведения работ' | 'Клиент'         | 'Договор'          |  'Специалист'     			 	|
	| '11.00'                     | '16.00'                        |  '08.03.2026'            | 'ЮГОРИЯ ГСК АО'	 | 'Основной договор' |  'Егорова Ирина Анатольевна'	|
