#language: ru

@tree

Функционал: Тестирование функционала Специалиста

Как Специалист я хочу  тестированием дозаполнить документы "Обслуживание клиента" и проверить функционал заполнения

Контекст:
	Дано я открыл сеанс TestClient от имени "Специалист" с паролем "" или подключаю уже существующий
	И я закрываю все окна клиентского приложения
Сценарий: Заполнение Документа 'Обслуживание клиента' - Специалист Дмитриев Юрий Анатольевич, 05.03.2026 с 08 по 12
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
И в таблице "Список" я перехожу к строке: 
	| "Номер" 	  | 
	| "000000007" |  
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *" 
	*Заполнение табличной части Товары
И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
И В таблице "ВыполненныеРаботы" я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"	
И в таблице "Список" я перехожу к строке
	| 'Наименование' 	   |
	| 'Оказываемые услуги' |
И в таблице  "Список" я перехожу на один уровень вниз
И в таблице 'Список' я перехожу к строке
	| 'Наименование' 		|
	| 'Работы специалиста'  |
И в таблице 'Список' я выбираю текущую строку
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "4"
И я перехожу к следующему реквизиту		
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "4"
И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки	
	*Дополнительное заполнение закрытия заявки в комментарии	
И в поле с именем 'Комментарий' я ввожу текст 'Заявка выполнена специалистом Дмитриев Юрий Анатольевич.'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Обслуживание клиента (создание)*' в течение 20 секунд
Тогда открылось окно 'Обслуживание клиентов'

Контекст: И я закрываю все окна клиентского приложения

Сценарий: Заполнение Документа 'Обслуживание клиента' - Специалист Штиллер Юлия Андреевна, 06.03.2026 с 10 по 12
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
И в таблице "Список" я перехожу к строке: 
	| 'Номер' 	  | 
	| '000000008' | 
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *" 	
	*Заполнение табличной части Товары
И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
И В таблице "ВыполненныеРаботы" я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"	
И в таблице "Список" я перехожу к строке
	| 'Наименование' 	   |
	| 'Оказываемые услуги' |
И в таблице  "Список" я перехожу на один уровень вниз
И в таблице 'Список' я перехожу к строке
	| 'Наименование' 		|
	| 'Работы специалиста'  |
И в таблице 'Список' я выбираю текущую строку
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "2"
И я перехожу к следующему реквизиту		
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "2"
И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки	
	*Дополнительное заполнение закрытия заявки в комментарии	
И в поле с именем 'Комментарий' я ввожу текст 'Заявка выполнена специалистом Штиллер Юлия Андреевна.'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Обслуживание клиента (создание)*' в течение 20 секунд
Тогда открылось окно 'Обслуживание клиентов'

Контекст: И я закрываю все окна клиентского приложения

Сценарий: Заполнение Документа 'Обслуживание клиента' - Специалист Егорова Ирина Анатольевна, 07.03.2026 с 11 по 16
И В командном интерфейсе я выбираю 'Обслуживание клиентов' 'Обслуживание клиентов'
Тогда открылось окно 'Обслуживание клиентов'
И в таблице "Список" я перехожу к строке: 
	| 'Номер' 	  | 
	| '000000009' | 
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *" 	
	*Заполнение табличной части Товары
И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
И В таблице "ВыполненныеРаботы" я нажимаю кнопку выбора у реквизита с именем 'ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"	
И в таблице "Список" я перехожу к строке
	| 'Наименование' 	   |
	| 'Оказываемые услуги' |
И в таблице  "Список" я перехожу на один уровень вниз
И в таблице 'Список' я перехожу к строке
	| 'Наименование' 		|
	| 'Работы специалиста'  |
И в таблице 'Список' я выбираю текущую строку
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "5"
И я перехожу к следующему реквизиту		
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "5"
И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки	
	*Дополнительное заполнение закрытия заявки в комментарии	
И в поле с именем 'Комментарий' я ввожу текст 'Заявка выполнена специалистом Егорова Ирина Анатольевна.'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Обслуживание клиента (создание)*' в течение 20 секунд
Тогда открылось окно 'Обслуживание клиентов'