
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Объект.Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период создания актов реализации");
		Возврат;		
	КонецЕсли; 
	
	Если КонецМесяца(Объект.Период.ДатаНачала) <> КонецМесяца(Объект.Период.ДатаОкончания) Тогда 		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период создания актов реализации товаров и услуг должен составлять один полный месяц",,"Объект.Период");
		Возврат;		
	КонецЕсли;  
	
	
	// Запуск фонового задания на сервере.		
	СтруктураФоновогоЗадания = ЗапуститьЗаданиеНаСервере();
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал  = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры


&НаСервере
Функция ЗапуститьЗаданиеНаСервере()
												
//	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтотОбъект);
//	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокДокументовРеализацииТоваровИУслуг",
//												Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);

	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ДатаНачала", 	Объект.Период.ДатаНачала);
	ПараметрыЗапуска.Вставить("ДатаОкончания",	Объект.Период.ДатаОкончания);

	ВыполняемаяПроцедура = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокДокументовРеализацииТоваровИУслуг";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемаяПроцедура, Объект.Период.ДатаНачала,Объект.Период.ДатаОкончания);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
				
	Если ЗначениеЗаполнено(Объект.Период) И (Объект.Период.ДатаНачала <> НачалоМесяца(Объект.Период.ДатаНачала)
		Или Объект.Период.ДатаОкончания <> КонецМесяца(Объект.Период.ДатаОкончания)) Тогда 		
			Объект.Период.ДатаНачала = НачалоМесяца(Объект.Период.ДатаНачала);
			Объект.Период.ДатаОкончания = КонецМесяца(Объект.Период.ДатаОкончания);		
	КонецЕсли;
	
	Объект.Список.Очистить(); 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда  // Пользователь отменил задание.		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка отменена");
		Возврат;		
	КонецЕсли;	
	
	Если Результат.Статус = "Ошибка" Тогда		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;		
	КонецЕсли;	
			
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);	
	Объект.Список.Очистить();
	
	Если РезультатОбработки.ДокументовСоздано = 0 И РезультатОбработки.ДокументовНеСоздано = 0 Тогда		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для выбранного периода документы уже были созданы ранее");
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьСписокДокументов(РезультатОбработки.МассивДоговоровИРеализаций);
	
	ТекстСообщения = СтрШаблон("Для указанного периода создано документов: %1.
								|Не созданных документов по причине ошибок: %2. ", 	
								РезультатОбработки.ДокументовСоздано,РезультатОбработки.ДокументовНеСоздано);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСписокДокументов(МассивСписка); 
	
	Для Каждого ЭлементМассива Из МассивСписка Цикл 		
		СтрокаСписка = Объект.Список.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписка, ЭлементМассива);	
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти

