#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если  ОсновныеНачисления.Количество() = 0 И ДополнительныеНачисления.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ без табличых частей",,,,Отказ);
		Возврат;	
	КонецЕсли;	
	
	ДвиженияПоОсновнымНачислениям(); 
	ДвиженияСторноЗаписи();
	ДвиженияПоДополнительнымНачислениям();
	СформироватьНДФЛ();
	РасчитатьОклады();	
	РассчитатьОтпускныеНачисления();
	РасчитатьНДФЛ(); 
	ДвжиенияВзаиморасчетыССотрудниками(); 
	ДвиженияВыполненныеСотрудникомРаботы(Отказ)

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ДвиженияПоОсновнымНачислениям() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_СписокСотрудников
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.ОсновныеНачисления КАК ВКМ_НачислениеЗарплатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗарплатыОсновныеНачисления.ВидРасчета = &Оклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокСотрудников.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(BKM_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
		|ПОМЕСТИТЬ ВТ_Оклады
		|ИЗ
		|	ВТ_СписокСотрудников КАК ВТ_СписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
		|				&ДатаДокумента,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВКМ_НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|					ИЗ
		|						Документ.ВКМ_НачислениеЗарплаты.ОсновныеНачисления КАК ВКМ_НачислениеЗарплатыОсновныеНачисления
		|					ГДЕ
		|						ВКМ_НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|						И ВКМ_НачислениеЗарплатыОсновныеНачисления.ВидРасчета = &Оклад)) КАК BKM_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_СписокСотрудников.Сотрудник = BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.ГрафикРабот КАК ГрафикРабот,
		|	ВЫБОР
		|		КОГДА ВКМ_НачислениеЗарплатыОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.BKM_ОсновныеНачисления.Отпуск)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -12), МЕСЯЦ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК БазовыйПериодНачало,
		|	ВЫБОР
		|		КОГДА ВКМ_НачислениеЗарплатыОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.BKM_ОсновныеНачисления.Отпуск)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачислениеЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК БазовыйПериодКонец,
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Ссылка.Дата КАК ПериодРегистрации,
		|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Показатель
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.ОсновныеНачисления КАК ВКМ_НачислениеЗарплатыОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
		|		ПО ВКМ_НачислениеЗарплатыОсновныеНачисления.Сотрудник = ВТ_Оклады.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("Оклад", 			ПланыВидовРасчета.BKM_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ДатаДокумента",	Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Движения.BKM_ОсновныеНачисления.Записывать = Истина; 
	
	// регистр BKM_ОсновныеНачисления 	
	Пока Выборка.Следующий() Цикл 		
		// Пропустить записи с нулевым или несуществующимим окладами
		Если Выборка.ВидРасчета = ПланыВидовРасчета.BKM_ОсновныеНачисления.Оклад 
			И Выборка.Показатель = 0 Тогда		
				Продолжить;	
		КонецЕсли; 
		
		ДвижениеОсновныеНачисления = Движения.BKM_ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(ДвижениеОсновныеНачисления, Выборка);		
	КонецЦикла;   
			
	Движения.BKM_ОсновныеНачисления.Записать();
		
КонецПроцедуры  

Процедура ДвиженияСторноЗаписи()
      
      СторноЗаписиДополнение = Движения.BKM_ОсновныеНачисления.ПолучитьДополнение();
      
	  Если Не ЗначениеЗаполнено(СторноЗаписиДополнение) Тогда
	      Возврат;
	  КонецЕсли; 
	  
	  Для Каждого Запись Из СторноЗаписиДополнение Цикл      
	      // Движения по регистру ВКМ_ОсновныеНачисления
	      Движение = Движения.BKM_ОсновныеНачисления.Добавить();		  
	      ЗаполнитьЗначенияСвойств(Движение, Запись);
	      Движение.Сторно = Истина;
	      Движение.ПериодРегистрации = Дата;
	      Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
	      Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;		        	  
	  КонецЦикла;
	  
	  Движения.BKM_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура ДвиженияПоДополнительнымНачислениям()	
	
	// регистр BKM_ДополнительныеНачисления	                   	
	Движения.BKM_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл		
		Движение = Движения.BKM_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.BKM_ДополнительныеНачисления.ПремияПроцентом;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаДополнительныеНачисления.СуммаНачисления;		
	КонецЦикла;
	
	Движения.BKM_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.ОсновныеНачисления КАК ВКМ_НачислениеЗарплатыОсновныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыДополнительныеНачисления.Сотрудник
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.ДополнительныеНачисления КАК ВКМ_НачислениеЗарплатыДополнительныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыДополнительныеНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сотрудники.Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	// регистр BKM_Удержания 
	Движения.BKM_Удержания.Записывать = Истина;
	
	Пока Выборка.Следующий()  Цикл		
		Движение = Движения.BKM_Удержания.Добавить(); 
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.BKM_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;        
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Сотрудник = Выборка.Сотрудник;		
	КонецЦикла;
	
	Движения.BKM_Удержания.Записать();	
	
КонецПроцедуры

Процедура РасчитатьОклады() 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК Норма,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
		|ИЗ
		|	РегистрРасчета.BKM_ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Регистратор
		|				И ВидРасчета = &ВидРасчета) КАК BKM_ОсновныеНачисленияДанныеГрафика";	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета" , ПланыВидовРасчета.BKM_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		// Движения по регистру ВКМ_ОсновныеНачисления
		Движение = Движения.BKM_ОсновныеНачисления[Выборка.НомерСтроки - 1];		
		Если Выборка.Норма <> 0 Тогда
			Движение.Результат = Движение.Показатель * Выборка.Факт / Выборка.Норма;
		КонецЕсли;			
		Движение.ОтработаноДней = Выборка.Факт;
		
		Если Движение.Сторно Тогда 			
			Движение.Результат = -Движение.Результат;
			Движение.ОтработаноДней = -Движение.ОтработаноДней;			
		КонецЕсли;
		
	КонецЦикла; 		
	Движения.BKM_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьОтпускныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления.РезультатБаза, 0) + ЕСТЬNULL(BKM_ОсновныеНачисленияБазаBKM_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
		|	ЕСТЬNULL(BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДнейБаза
		|ИЗ
		|	РегистрРасчета.BKM_ОсновныеНачисления КАК BKM_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_ОсновныеНачисления.БазаBKM_ОсновныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Регистратор
		|					И ВидРасчета = &Отпуск) КАК BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления
		|		ПО BKM_ОсновныеНачисления.НомерСтроки = BKM_ОсновныеНачисленияБазаBKM_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_ОсновныеНачисления.БазаBKM_ДополнительныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Регистратор
		|					И ВидРасчета = &Отпуск) КАК BKM_ОсновныеНачисленияБазаBKM_ДополнительныеНачисления
		|		ПО BKM_ОсновныеНачисления.НомерСтроки = BKM_ОсновныеНачисленияБазаBKM_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_ОсновныеНачисления.ДанныеГрафика(
		|				Регистратор = &Регистратор
		|					И ВидРасчета = &Отпуск) КАК BKM_ОсновныеНачисленияДанныеГрафика
		|		ПО BKM_ОсновныеНачисления.НомерСтроки = BKM_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	BKM_ОсновныеНачисления.Регистратор = &Регистратор
		|	И BKM_ОсновныеНачисления.ВидРасчета = &Отпуск";	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.BKM_ОсновныеНачисления.Отпуск);
	ИзмеренияСотрудников = Новый Массив; 
	ИзмеренияСотрудников.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения",   ИзмеренияСотрудников);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		//Движения по Основным начислениям		
		Движение = Движения.BKM_ОсновныеНачисления[Выборка.НомерСтроки -1];	
		Движение.Показатель =  Выборка.РезультатБаза;
	
		Если Выборка.ОтработаноДнейБаза <> 0 Тогда
			Движение.Результат = Выборка.РезультатБаза * Выборка.Факт / Выборка.ОтработаноДнейБаза ;
		КонецЕсли;		
		Движение.ОтработаноДней = Выборка.Факт;
		
		Если Движение.Сторно Тогда 			
			Движение.Результат = -Движение.Результат; 
			Движение.ОтработаноДней = -Выборка.Факт;
		КонецЕсли;			
	КонецЦикла;	
	Движения.BKM_ОсновныеНачисления.Записать(,Истина); 
	
КонецПроцедуры

Процедура РасчитатьНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБазаОсновныеНачисления,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления (
		|			&Измерения,
		|			&Измерения,
		|			&Разрезы,
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
		|ГДЕ
		|	BKM_УдержанияБазаBKM_ОсновныеНачисления.Регистратор = BKM_УдержанияБазаBKM_ОсновныеНачисления.РегистраторРазрез
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБазаДополнительныеНачисления,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки, 0) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления (
		|			&Измерения,
		|			&Измерения,
		|			&Разрезы,
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|ГДЕ
		|	BKM_УдержанияБазаBKM_ДополнительныеНачисления.Регистратор = BKM_УдержанияБазаBKM_ДополнительныеНачисления.РегистраторРазрез	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ДополнительныеНачисления.РезультатБазаДополнительныеНачисления, 0) +
		|		ЕСТЬNULL(ВТ_ОсновныеНачисления.РезультатБазаОсновныеНачисления, 0) КАК БазаНДФЛ,
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВТ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВТ_ДополнительныеНачисления.НомерСтроки
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|	И ВКМ_Удержания.ВидРасчета = &НДФЛ"; 		
	Запрос.УстановитьПараметр("НДФЛ",   ПланыВидовРасчета.BKM_Удержания.НДФЛ);   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ИзмеренияСотрудник = Новый Массив; 
	ИзмеренияСотрудник.Добавить("Сотрудник");                                 	
	Разрезы = Новый Массив; 
	Разрезы.Добавить("Регистратор");
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	Запрос.УстановитьПараметр("Измерения", ИзмеренияСотрудник);
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл		
		Движение = Движения.BKM_Удержания[Выборка.НомерСтроки - 1];
		Движение.Результат = Выборка.БазаНДФЛ * 13 / 100;		
	КонецЦикла;	
	Движения.BKM_Удержания.Записать(,Истина);
	
КонецПроцедуры

Процедура ДвжиенияВзаиморасчетыССотрудниками()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Результаты
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник,
		|	-ЕСТЬNULL(ВКМ_Удержания.Результат, 0)
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результаты.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_Результаты.Сумма) КАК Сумма
		|ИЗ
		|	ВТ_Результаты КАК ВТ_Результаты
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Результаты.Сотрудник";	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	// регистр BKM_ВзаиморасчетыССотрудниками Приход	
	Движения.BKM_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Пока Выборка.Следующий() Цикл	
		Движение = Движения.BKM_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;	
	КонецЦикла;
	
КонецПроцедуры 

Процедура ДвиженияВыполненныеСотрудникомРаботы(Отказ)

	Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.BKM_ВыполненныеСотрудникомРаботы.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.BKM_ВыполненныеСотрудникомРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ДополнительныеНачисления;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ВКМ_НачислениеЗарплатыДополнительныеНачисления.СуммаНачисления,0)) КАК СуммаНачисления,
		|	СУММА(ЕСТЬNULL(ВКМ_НачислениеЗарплатыДополнительныеНачисления.НачисленоЧасов,0)) КАК НачисленоЧасов
		|ПОМЕСТИТЬ ВТ_Сотрудник
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.ДополнительныеНачисления КАК ВКМ_НачислениеЗарплатыДополнительныеНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыДополнительныеНачисления.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_НачислениеЗарплатыДополнительныеНачисления.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Сотрудник.Сотрудник) КАК ПредставлениеСотрудник,
		|	ВТ_Сотрудник.СуммаНачисления КАК СуммаКОплате,
		|	ВТ_Сотрудник.НачисленоЧасов КАК ЧасовКОплате,
		|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток, 0) КАК СуммаКОплатеОстаток,
		|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстатки.ЧасовКОплатеОстаток, 0) КАК ЧасовКОплатеОстаток
		|ИЗ
		|	ВТ_Сотрудник КАК ВТ_Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.BKM_ВыполненныеСотрудникомРаботы.Остатки(
		|				&МоментВремени,
		|				Сотрудник В
		|					(ВЫБРАТЬ
		|						ВТ_Сотрудник.Сотрудник КАК Сотрудник
		|					ИЗ
		|						ВТ_Сотрудник КАК ВТ_Сотрудник)) КАК BKM_ВыполненныеСотрудникомРаботыОстатки
		|		ПО ВТ_Сотрудник.Сотрудник = BKM_ВыполненныеСотрудникомРаботыОстатки.Сотрудник";	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("МоментВремени",  МоментВремени());
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Пока  Выборка.Следующий() Цикл		
		Если Выборка.СуммаКОплате > Выборка.СуммаКОплатеОстаток Тогда			
			ТекстСообщения = СтрШаблон("Для сотрудника %1 сумма начисления (%2) больше чем сумма за выполненные работы (%3)",
				Выборка.ПредставлениеСотрудник,Выборка.СуммаКОплате, Выборка.СуммаКОплатеОстаток);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 		
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;		
		//Движения по регистру BKM_ВыполненныеСотрудникомРаботы 
		Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.СуммаКОплате = Выборка.СуммаКОплате;
		
		Если  Выборка.СуммаКОплате =  Выборка.СуммаКОплатеОстаток Тогда
			Движение.ЧасовКОплате = Выборка.ЧасовКОплатеОстаток;
		Иначе				 
			Движение.ЧасовКОплате = Выборка.ЧасовКОплате;
		Конецесли;				
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти

#КонецЕсли