#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	
	
Функция ДобавитьУведомление(ТекстСообщения) Экспорт		
		СоздатьУведомление = СоздатьЭлемент();
		СоздатьУведомление.ТекстСообщения = ТекстСообщения; 
		
		Попытка 			
			СоздатьУведомление.Записать(); 
			Возврат СоздатьУведомление;			
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке());
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИнформацияОбОшибке(), УровеньЖурналаРегистрации.Ошибка);		
			Возврат Неопределено;			
		КонецПопытки;		
		
КонецФункции
	
#КонецОбласти
	
#КонецЕсли