
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//ВКМ ++ ОбслуживаниеКлиентов
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";		
		Возврат КомандаСоздатьНаОсновании;		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции    

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОказанныхУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт оказанных услуг'");
	//КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";	
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка"; 
	КомандаПечати.Порядок = 10;

КонецПроцедуры 

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

 // Добавление печатной формы Акта об оказанных услугах
 //
 Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
				
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОказанныхУслуг") Тогда
 		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктОказанныхУслуг", "АктОказанныхУслуг", 
			СформироватьНесколькоАктов(МассивОбъектов),"Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОказанныхУслуг");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьНесколькоАктов(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ПервыйДокумент = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОказанныхУслуг");
	ОбластьЗаголовокДокумента 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы 		= Макет.ПолучитьОбласть("ШапкаТЧ");
	ОбластьСтрока 				= Макет.ПолучитьОбласть("СтрокаТЧ");
	ОбластьИтого 				= Макет.ПолучитьОбласть("Итого");  
	ОбластьИтогоПрописью 		= Макет.ПолучитьОбласть("ИтогиСумма");
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");	 
	
	ПервыйДокумент = Истина;
	ВыборкаДанных = ПолучитьДанныеДокументов(МассивОбъектов);
	
	Пока ВыборкаДанных.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДанных.Номер));
		ДанныеПечати.Вставить("ДатаДокумента", 	Формат(ВыборкаДанных.Дата, "ДЛФ=DD"));
		ДанныеПечати.Вставить("Организация", 	ВыборкаДанных.Организация);
		ДанныеПечати.Вставить("Контрагент", 	ВыборкаДанных.Контрагент);
		ДанныеПечати.Вставить("Договор", 		ВыборкаДанных.Договор);
		ДанныеПечати.Вставить("ДатаДоговора",  	Формат(ВыборкаДанных.ДатаДоговора, "ДЛФ=DD"));	
	
		ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
		ТабДокумент.Вывести(ОбластьЗаголовокДокумента);

		ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		Итого = 0;
		ВыборкаДанныхУслуги = ВыборкаДанных.Услуги.Выбрать();
	
			Пока ВыборкаДанныхУслуги.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаДанныхУслуги);
				ТабДокумент.Вывести(ОбластьСтрока);	
				Итого = Итого + ВыборкаДанныхУслуги.Сумма;		
			КонецЦикла;
		
		ОбластьИтого.Параметры.Итого = Итого;
		ТабДокумент.Вывести(ОбластьИтого);
		
		ОбластьИтогоПрописью.Параметры.Сумма = Итого;
		ОбластьИтогоПрописью.Параметры.СуммаПрописью = ЧислоПрописью(Итого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");		
		ТабДокумент.Вывести(ОбластьИтогоПрописью);		
			
		ТабДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьДанныеДокументов(Документы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Номер КАК Номер,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	РеализацияТоваровУслуг.Организация КАК Организация,
	               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	               |	РеализацияТоваровУслуг.Договор КАК Договор,
	               |	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	               |	РеализацияТоваровУслуг.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги,
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Дата КАК ДатаДоговора
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Ссылка В (&Документы)";	
	Запрос.УстановитьПараметр("Документы", Документы);	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
//ВКМ -- ОбслуживаниеКлиентов


#КонецОбласти


#КонецЕсли