
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
	// ++ ВКМ ВКМ_АбонентскоеОбслуживание	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ВыборкаИзРезультатаЗапроса") Тогда  // Заполнение реквизитов значениями из выборки запроса
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;	
	// -- ВКМ 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
	//ВКМ ++ ОбслуживаниеКлиентов
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда			
		Если Услуги.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В документе не заполнены услуги",,,,Отказ);
			Возврат;		
		ИначеЕсли  Не НоменклатураЗаполненаВерно()Тогда
			ОбщегоНазначения.СообщитьПользователю("В акте реализации используются неразрешенные услуги",,,,Отказ);
			Возврат;			
		ИначеЕсли  ВКМ_АдаптацияДокументаРеализацияТоваровИУслугСервер.ДокументСуществует(ЭтотОбъект) <> Истина Тогда	
			ОбщегоНазначения.СообщитьПользователю("По текущим параметрам уже есть созданный документ",,,,Отказ); 
			Возврат;			
		КонецЕсли;
		
	КонецЕсли; 	
	//ВКМ -- ОбслуживаниеКлиентов
	
КонецПроцедуры

//ВКМ ++ ОбслуживаниеКлиентов  
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//Движение = Движения.ОбработкаЗаказов.Добавить();
	//Движение.Период = Дата;
	//Движение.Контрагент = Контрагент;
	//Движение.Договор = Договор;
	//Движение.Заказ = Основание;
	//Движение.СуммаОтгрузки = СуммаДокумента;

	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	//	Движение = Движения.ОстаткиТоваров.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Контрагент = Контрагент;
	//	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//	Движение.Сумма = ТекСтрокаТовары.Сумма;
	//	Движение.Количество = ТекСтрокаТовары.Количество;
	//КонецЦикла; 
	
	
	//Переработка  движений		
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора") <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда		
		Движение = Движения.ОбработкаЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Заказ = Основание;
		Движение.СуммаОтгрузки = СуммаДокумента; 
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
	Иначе 		
		Если Не  ВКМ_АдаптацияДокументаРеализацияТоваровИУслугСервер.ЗаполнениеДокумента(ЭтотОбъект) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// Старая методика проведения	
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Клиент", 	Контрагент);
		ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
		Попытка		
			Блокировка.Заблокировать();		
		Исключение	
			ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке(),,,,Отказ);
			Возврат;			
		КонецПопытки;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(РеализацияТоваровУслугУслуги.Сумма, 0)) КАК СуммаКОплате,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Ссылка) КАК ПредставлениеДокумента
		|ПОМЕСТИТЬ ВТ_СуммаКОплате
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугУслуги.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|				ВКМ_НоменклатураРаботыСпециалиста.Значение КАК Значение
		|			ИЗ
		|				Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста)
		|	И РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Договор,
		|	РеализацияТоваровУслуг.Контрагент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СуммаКОплате.СуммаКОплате КАК СуммаКОплате,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстатки.КоличествоЧасовОстаток, 0) КАК КоличествоЧасовОстаток,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток, 0) КАК СуммаКОплатеОстаток,
		|	ВТ_СуммаКОплате.Договор КАК Договор,
		|	ВТ_СуммаКОплате.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ВТ_СуммаКОплате.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0) КАК СтоимостьЧасаРаботыСпециалиста, 
		|	ВТ_СуммаКОплате.ПредставлениеДокумента КАК ПредставлениеДокумента
		|ИЗ
		|	ВТ_СуммаКОплате КАК ВТ_СуммаКОплате
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(
		|				&МоментВремени,
		|				Договор = &Договор
		|					И Клиент = &Контрагент) КАК ВКМ_ВыполненныеКлиентуРаботыОстатки
		|		ПО ВТ_СуммаКОплате.Договор = ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор
		|			И ВТ_СуммаКОплате.Контрагент = ВКМ_ВыполненныеКлиентуРаботыОстатки.Клиент";	
		Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
		Запрос.УстановитьПараметр("МоментВремени", 	МоментВремени());
		Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
		Запрос.УстановитьПараметр("Договор", 		Договор);		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если  Выборка.Следующий() Тогда  		
			Если Выборка.СуммаКОплате > Выборка.СуммаКОплатеОстаток Тогда				
				ТекстСообщения = "Необходимая сумма больше чем сумма выполненных работ" ;
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка);				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Возврат;				
			КонецЕсли;
						
			// Движения по регистру ВКМ_ВыполненныеКлиентуРаботы 
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;			
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.Клиент 		= Контрагент;
			Движение.Договор 		= Договор;
			Движение.СуммаКОплате 	= Выборка.СуммаКОплате;			
			Если Выборка.СуммаКОплате = Выборка.СуммаКОплатеОстаток Тогда
				Движение.КоличествоЧасов = Выборка.КоличествоЧасовОстаток;
			Иначе				
				Если Выборка.СтоимостьЧасаРаботыСпециалиста <> 0 Тогда
					Движение.КоличествоЧасов = Выборка.СуммаКОплате/Выборка.СтоимостьЧасаРаботыСпециалиста;	
				КонецЕсли;				
			КонецЕсли;				
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Функция НоменклатураЗаполненаВерно()
	
	ВКМ_НоменклатураАбонентскаяПлата  = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();   
	ВКМ_НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Для Каждого Услуга Из Услуги Цикл
		Если Услуга.Номенклатура <> ВКМ_НоменклатураАбонентскаяПлата 
			И Услуга.Номенклатура <> ВКМ_НоменклатураРаботыСпециалиста Тогда			
				Возврат Ложь;			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Истина;	
	
КонецФункции

Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт
	
	Отказ = Ложь;
	НоменклатураАбонентскаяПлата 	= Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста 	= Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		ТекстСообщения = "Значение ""Номенклатура абонентская плата"" не заполнено.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		ТекстСообщения = "Значение ""Номенклатура работы специалиста"" не заполнено.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Услуги.Очистить();		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.КоличествоЧасовОборот, 0) + ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.КоличествоЧасовНачальныйОстаток, 0) КАК КоличествоЧасовОборот,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.СуммаКОплатеОборот, 0) + ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.СуммаКОплатеНачальныйОстаток, 0) КАК СуммаКОплатеОборот,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0) КАК ДоговорВКМ_СтоимостьЧасаРаботыСпециалиста
		|ПОМЕСТИТЬ ВТ_Обороты
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			,
		|			Договор = &Договор
		|				И Клиент = &Контрагент) КАК ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов, 0),
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате, 0),
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0)
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|ГДЕ
		|	ВКМ_ВыполненныеКлиентуРаботы.Клиент = &Контрагент
		|	И ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
		|	И ВКМ_ВыполненныеКлиентуРаботы.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Обороты.КоличествоЧасовОборот) КАК КоличествоЧасовОборот,
		|	СУММА(ВТ_Обороты.СуммаКОплатеОборот) КАК СуммаКОплатеОборот,
		|	ВТ_Обороты.ДоговорВКМ_СтоимостьЧасаРаботыСпециалиста КАК ДоговорВКМ_СтоимостьЧасаРаботыСпециалиста
		|ПОМЕСТИТЬ ВТ_Сгруппировано
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Обороты.ДоговорВКМ_СтоимостьЧасаРаботыСпециалиста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_НоменклатураАбонентскаяПлата.Значение КАК Номенклатура,
		|	1 КАК Количество,
		|	ДоговорыКонтрагентов.ВКМ_ЕжемесячнаяАбонентскаяПлата КАК Цена,
		|	ДоговорыКонтрагентов.ВКМ_ЕжемесячнаяАбонентскаяПлата КАК Сумма
		|ИЗ
		|	Константа.ВКМ_НоменклатураАбонентскаяПлата КАК ВКМ_НоменклатураАбонентскаяПлата,
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор
		|	И ДоговорыКонтрагентов.ВКМ_ЕжемесячнаяАбонентскаяПлата > 0
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_НоменклатураРаботыСпециалиста.Значение,
		|	ЕСТЬNULL(ВТ_Сгруппировано.КоличествоЧасовОборот, 0),
		|	ЕСТЬNULL(ВТ_Сгруппировано.ДоговорВКМ_СтоимостьЧасаРаботыСпециалиста, 0),
		|	ЕСТЬNULL(ВТ_Сгруппировано.СуммаКОплатеОборот, 0)
		|ИЗ
		|	Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста,
		|	ВТ_Сгруппировано КАК ВТ_Сгруппировано";	
    Запрос.УстановитьПараметр("Ссылка", 		Ссылка);	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация); 
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Дата));
	                                                              
	РезультатЗапроса = Запрос.Выполнить(); 		
	Если  РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса.Выгрузить(),Услуги);
	СуммаДокумента = Услуги.Итог("Сумма");		

КонецПроцедуры
//ВКМ -- ОбслуживаниеКлиентов

#КонецОбласти

#КонецЕсли
