#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
	Перем ОповещениеТелеграммБоту; // Для того, чтобы не создавать реквизит и не писать переменную в процедурах
#КонецОбласти


#Область ОбработчикиСобытий   

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ОповещениеТелеграммБоту = СформироватьСообщениеТелеграммБоту();	 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда     	
     	Возврат;     	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОповещениеТелеграммБоту) Тогда 
		ОповещениеТелеграммБоту = СтрЗаменить(ОповещениеТелеграммБоту,"Заявка",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		Если Справочники.ВКМ_УведомленияТелеграм.ДобавитьУведомление(ОповещениеТелеграммБоту) = Неопределено Тогда			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Запись не создана в справочнике уведомлений Телеграм", УровеньЖурналаРегистрации.Ошибка);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЗаполнениеОбъекта(Отказ); 	
	// Проверить табличную часть на предмет заполнения выполненных работ.	
	Если ВыполненныеРаботы.Количество() = 0 Тогда				
		Возврат; //Менеджер по обслуживанию может заводить документы без заполнения табличных частей
	КонецЕсли;	

	ПроцентОплатыОтРабот = ПолучитьПроцентОплатыОтРабот(Дата, Специалист);
	Если ПроцентОплатыОтРабот = Неопределено Тогда 
		ТекстСообщения = СтрШаблон("У сотрудника %1 не установлен процент оплаты от выполненных работ",Специалист);		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);	
		Отказ = Истина;	
	КонецЕсли;
	
	Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
			
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать 	 = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СтоимостьЧасаРаботыСпециалиста");
	
	//Движения по регистру ВКМ_ВыполненныеКлиентуРаботы 
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период 	 = Дата;
	Движение.Клиент		 = Клиент;
	Движение.Договор	 = Договор;
	Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
	Движение.СуммаКОплате	 = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаВДоговоре; 
	
	//Движения по регистру ВКМ_ВыполненныеСотрудникомРаботы 
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период		 = Дата;
	Движение.Сотрудник	 = Специалист;
	Движение.ЧасовКОплате	  = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Если ПроцентОплатыОтРабот = 0 Тогда
		Движение.СуммаКОплате = 0;
	Иначе
		Движение.СуммаКОплате = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаВДоговоре * ПроцентОплатыОтРабот / 100;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеОбъекта(Отказ) 
	
	СтруктураРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");	
	// Проверка вида договора
	Если СтруктураРеквизитовДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 	
		ТекстСообщения = "Документ не проведен так как договор не предусматривает абанонентского обслуживания.";		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);			
	Иначе		
		// Проверка действия договора 	
		Если СтруктураРеквизитовДоговора.ВКМ_ДатаНачалаДействияДоговора > Дата Или СтруктураРеквизитовДоговора.ВКМ_ДатаОкончанияДействияДоговора < Дата Тогда			
			ТекстСообщения = "Документ не проведен так как договор не дейстителен на текущую дату";			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);				
		КонецЕсли;		
	КонецЕсли;  
				
КонецПроцедуры

Функция ПолучитьПроцентОплатыОтРабот(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";	
	Запрос.УстановитьПараметр("ДатаДокумента",  Дата);
	Запрос.УстановитьПараметр("Сотрудник", 		Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.ПроцентОтРабот;		
	Иначе   		
		Возврат Неопределено; 		
	КонецЕсли;
	
КонецФункции

Функция СформироватьСообщениеТелеграммБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда		
		ТекстСообщения = "Создан новый документ обслуживания клиента.";		
	Иначе	
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
		
		ИзмененныеРеквизиты = Новый Структура;
		ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ИзмененныеРеквизиты.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
		ИзмененныеРеквизиты.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
		ИзмененныеРеквизиты.Вставить("Специалист", Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда			
			ТекстСообщения = "Произошли изменения в документе обслуживания клиента";			
		КонецЕсли;		
	КонецЕсли;	
	
	Если ТекстСообщения <> "" Тогда		
		ТекстСообщения = СтрШаблон("%1 №%2 от %3.
						|Контрагент %4.
						|Дата проведения работ запланирована на %5 с %6 по %7.
						|Назначен специалист: %8.",
						ТекстСообщения,
						ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер), 
						Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаРабот,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРабот,"ДФ=ЧЧ.мм"), Специалист);		
	КонецЕсли;
	
    Возврат ТекстСообщения; 
	
КонецФункции

#КонецОбласти 

#КонецЕсли
