
#Область СлужебныеПроцедурыИФункции

// Функция проверяет наличие сущиствующего докумета с данными предлагаемые к записи
// Параметры:
// ТекущийОбъект - ДокументОбъект
// Возвращаемое значение:
// 	ДокументСсылка 
// 	Неопределено
Функция ДокументСуществует(ТекущийОбъект) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
		|	И РеализацияТоваровУслугУслуги.Ссылка.Дата >= &ДатаНачалаПериода
		|	И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &ДатаОкончанияПериода
		|	И РеализацияТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|				ВКМ_НоменклатураАбонентскаяПлата.Значение КАК Номенклатура
		|			ИЗ
		|				Константа.ВКМ_НоменклатураАбонентскаяПлата КАК ВКМ_НоменклатураАбонентскаяПлата
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				ВКМ_НоменклатураРаботыСпециалиста.Значение
		|			ИЗ
		|				Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста)
		|	И РеализацияТоваровУслугУслуги.Ссылка.Договор = &Договор
		|	И РеализацияТоваровУслугУслуги.Ссылка.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И РеализацияТоваровУслугУслуги.Ссылка.Контрагент = &Контрагент
		|	И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация";
   	Запрос.УстановитьПараметр("Ссылка", 				ТекущийОбъект.Ссылка); 	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", 		НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", 	КонецМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("Договор", 				ТекущийОбъект.Договор); 
	Запрос.УстановитьПараметр("Контрагент", 			ТекущийОбъект.Контрагент);
    Запрос.УстановитьПараметр("Организация", 			ТекущийОбъект.Организация);
	
	Возврат Запрос.Выполнить().Пустой(); 
			
КонецФункции

// Проверка правильности заполнения документа РеализацияТоваровУслуг
// Параметры:
// 	 Объект - ДокументОбъект
// Возвращаемое значение:
// 	Булево
Функция ЗаполнениеДокумента(Знач Объект) Экспорт
	
	Если  Не ЗначениеЗаполнено(Объект.Договор) Тогда	
		ОбщегоНазначения.СообщитьПользователю("Не указан договор",,"Объект.Договор");
		Возврат Ложь;
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ВидДоговора") <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда		
		ОбщегоНазначения.СообщитьПользователю("Договор не предполагает абоненсткого обслуживания",,"Объект.Договор");
		Возврат Ложь;		
	КонецЕсли;  
		
	СтруктураДатыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,"ВКМ_ДатаНачалаДействияДоговора,ВКМ_ДатаОкончанияДействияДоговора");
	Если СтруктураДатыДоговора.ВКМ_ДатаНачалаДействияДоговора > Объект.Дата 
		Или СтруктураДатыДоговора.ВКМ_ДатаОкончанияДействияДоговора < Объект.Дата Тогда
			ОбщегоНазначения.СообщитьПользователю("Договор не действителен на дату документа",,"Объект.Договор");
			Возврат Ложь;		 		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьДополнительныеЭлементыФормы(Форма)Экспорт
	
	//Дополнительная кнопка
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "ВКМ_КомандаЗаполнить";
	КомандаЗаполнить.Заголовок = "Заполнить"; 
	
	КнопкаЗаполнить = Форма.Элементы.Добавить("КнопкаСформироватьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить"; 
	КнопкаЗаполнить.Картинка 	= БиблиотекаКартинок.ВажностьВысокая;
	КнопкаЗаполнить.Отображение = ОтображениеКнопки.КартинкаИТекст; 
		
КонецПроцедуры

#КонецОбласти
