#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьВедомость(Команда) 
		
	Если Объект.Выплаты.Количество() <> 0 Тогда		
		Результат = Ждать ВопросАсинх("Табличная часть - Выплаты будет очищена. Продолжить?", 
			РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 		
	КонецЕсли;                
	
	Объект.Выплаты.Очистить();	
	ЗаполнитьВедомостьНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВедомостьНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаДокумента, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|ГДЕ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет данных для формирования зарплатной ведомости");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), Выборка);		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
