#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ДобавитьНовыеРеквизитыФормы();
	ДобавитьНовыеЭлементыФормы();  
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание Тогда		
		//Перенести период в элемент справочника
		ТекущийОбъект.BKM_ДатаНачалаДействияДоговора 	= ЭтотОбъект.ПериодДействияДоговора.ДатаНачала;
		ТекущийОбъект.BKM_ДатаОкончанияДействияДоговора = ЭтотОбъект.ПериодДействияДоговора.ДатаОкончания;		
	Иначе		
		//Дополнительное очищение реквизитов     
		ТекущийОбъект.BKM_ДатаНачалаДействияДоговора 		= Дата(1,1,1);
		ТекущийОбъект.BKM_ДатаОкончанияДействияДоговора 	= Дата(1,1,1);
		ТекущийОбъект.BKM_ЕжемесячнаяАбонентскаяПлата 		= 0;
		ТекущийОбъект.ВКМ_СтоимостьЧасаРаботыСпециалиста 	= 0;		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции   

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	УстановитьВидимостьДопИнформации(ЭтотОбъект);
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьНовыеЭлементыФормы()

	// Создать группу для новых элементов формы.       
	Если Элементы.Найти("ГруппаАбонентскоеОбслуживание") = Неопределено Тогда
		ГруппаАбонентскоеОбслуживание = Элементы.Добавить("ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"),ЭтотОбъект);
		ГруппаАбонентскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаАбонентскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаАбонентскоеОбслуживание.ОтображатьЗаголовок = Ложь;
		ГруппаАбонентскоеОбслуживание.Отображение = ОтображениеОбычнойГруппы.Нет;   
	Иначе 
		УстановитьВидимостьДопИнформации(ЭтотОбъект);	
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("ПериодДействияДоговора", Тип("ПолеФормы"),ГруппаАбонентскоеОбслуживание );		
	НовыйЭлемент.ПутьКДанным = "ПериодДействияДоговора";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;     
	
	НовыйЭлемент.Заголовок = "Период действия договора";
	НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"),ГруппаАбонентскоеОбслуживание);		
	НовыйЭлемент.ПутьКДанным = "Объект.BKM_ЕжемесячнаяАбонентскаяПлата";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Ежемесячная абонентская плата"; 
	
	НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);		
	НовыйЭлемент.ПутьКДанным = "Объект.BKM_СтоимостьЧасаРаботыСпециалиста";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";  	
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");	
	УстановитьВидимостьДопИнформации(ЭтотОбъект);	

КонецПроцедуры 

&НаСервере
Процедура ДобавитьНовыеРеквизитыФормы()

	//По заданию добавить Период ПериодДействияДоговора (Для удобства ввода дат)
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПериодДействияДоговора",	Новый ОписаниеТипов("СтандартныйПериод")));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);       
	
	// Заполнить период согласно дат действия договора
	ЭтотОбъект.ПериодДействияДоговора.ДатаНачала 	= НачалоДня(Объект.BKM_ДатаНачалаДействияДоговора);
	ЭтотОбъект.ПериодДействияДоговора.ДатаОкончания = КонецДня(Объект.BKM_ДатаОкончанияДействияДоговора);	
	
КонецПроцедуры   

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДопИнформации(Форма)

	Форма.Элементы.ГруппаПрограммноСозданныеЭлементыФормы.Видимость = 
			Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание");		

КонецПроцедуры

#КонецОбласти    




	
