#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДополнительныеЭлементыФормы(Форма)Экспорт
	
	//Дополнительная команда для Абонентского договора
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие 	= "ВКМ_ВыполнитьКомандуЗаполнить";
	КомандаЗаполнить.Заголовок 	= "Заполнить"; 
	
	КнопкаЗаполнить = Форма.Элементы.Добавить("КнопкаСформироватьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды 	= "Заполнить"; 
	КнопкаЗаполнить.Картинка 	= БиблиотекаКартинок.ВажностьВысокая;
	КнопкаЗаполнить.Отображение = ОтображениеКнопки.КартинкаИТекст; 
		
КонецПроцедуры

#КонецОбласти
