#Область ПрограммныйИнтерфейс

// Отправляет уведомления в телеграмм
Процедура ОтправитьУведомленияВТелеграмм() Экспорт
	
	Токен = Константы.ВКМ_ТокенТелеграмБот.Получить();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение  в телеграмм не отправлено", УровеньЖурналаРегистрации.Ошибка,,, 
		"Токен для Телегамм не установлен.");
		Возврат;		
	КонецЕсли;
	
	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
	
	Если Не ЗначениеЗаполнено(ИдентификаторЧата) Тогда		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение  в телеграмм не отправлено", УровеньЖурналаРегистрации.Ошибка,,, 
		"Идентификатор чата для Телеграмм не установлен.");
		Возврат;		
	КонецЕсли;
	
	Выборка = ПолучитьУведомленияДляОтправки();
		
	Пока Выборка.Следующий() Цикл		
		Ответ = ОтправитьСообщениеВТелеграмм(Выборка.ТекстСообщения, Токен, ИдентификаторЧата);
		Если Ответ = Неопределено Тогда		
			Продолжить;				
		КонецЕсли; 
		
		Если Ответ.КодСостояния = 200 Тогда			
			УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();	
			УведомлениеОбъект.Удалить();			
		Иначе			
			ОписаниеОшибки = Ответ.ПолучитьТелоКакСтроку();	
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Сообщение  в телеграмм не отправлено", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСообщениеВТелеграмм(Знач ТекстСообщения, Знач Токен, Знач ИдентификаторЧата)
	
	Ответ = Неопределено;
	
	Попытка 
		
		//1 метод отправки
		Соединение = Новый HTTPСоединение("api.telegram.org",,,,,, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("chat_id",ИдентификаторЧата);
		ДанныеСообщения.Вставить("text",ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,ДанныеСообщения);
		СообщениеДляОтправки = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		
		АдресURL = СтрШаблон("/bot%1/sendMessage", Токен);
		HTTPЗапрос = Новый HTTPЗапрос(АдресURL, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СообщениеДляОтправки);
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);    
		
		////2 метод отправки
		//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь); // необходим, что бы обойти блокировки
		//ИнтернетПрокси.Установить("https","178.128.31.153",Число("8080"), "", "", Ложь);// заполняем порт и ip - Прокси и порт взяты с https://hide-my-name.work/proxy-list/?type=s#list
		//Соединение = Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL());//создаем соединение
		////ПараметрыЗапроса = "?chat_id=" //параметр команды который говорит в какой чат писать боту
		////	+ Формат(ИдентификаторЧата, "ЧГ=0") //вводим имя чата формата  @*****
		////	+ "&text="  //параметр команды который говорит что писать боту
		////	+ КодироватьСтроку(ТекстСообщения,СпособКодированияСтроки.КодировкаURL);//меняем кодировку для гиперссылки
		////	
		////ТекстЗапросаHTTP = "bot" //ключ - что работаем с ботом
		////	+ Токен // id бота
		////	+ "/sendMessage" //команда к действию - написать сообщение
		////	+ ПараметрыЗапроса; //собственно параметры команды
		//ТекстЗапросаHTTP = "bot"+Токен+"/sendMessage?chat_id="+ИдентификаторЧата+"&text="+ ТекстСообщения;
		//
		//Запрос = Новый HTTPЗапрос(ТекстЗапросаHTTP);
		////Ответ = Соединение.ОтправитьДляОбработки(Запрос); 
		//Ответ = Соединение.Получить(Запрос);     
		
		
		////3 метод отправки
		//	ПроксиСервер        = "socks5://jqlwb.teletype.live"; // Собственно вот здесь мы и обращаемся через socks5
		//	ПроксиПорт            = 1080;
		//	ПроксиПользователь    = "telegram";
		//	ПроксиПароль        = "telegram";  
		//	ИнтернетПрокси = Новый ИнтернетПрокси;
		//	ИнтернетПрокси.Установить("https", ПроксиСервер, ПроксиПорт, ПроксиПользователь, ПроксиПароль);
		//
		//	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows);
		//	Ресурс = "bot" + Токен + "/sendMessage?chat_id=" + СтрЗаменить(Формат(ИдентификаторЧата, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text= " + ТекстСообщения;
		//	Соединение  =  Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,ЗащищенноеСоединение);
		//	Запрос = Новый HTTPЗапрос(Ресурс);
		//	Ответ = Соединение.Получить(Запрос); 
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщения в телеграмм. Непредвиденная ошибка.",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());		
		Возврат Неопределено;
		
	КонецПопытки;
	
		Возврат Ответ;
		
КонецФункции

Функция ПолучитьУведомленияДляОтправки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	BKM_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	               |	BKM_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	               |ИЗ
	               |	Справочник.BKM_УведомленияТелеграмБоту КАК BKM_УведомленияТелеграмБоту";

	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти 

 