#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();

	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка данных для построения графика"); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);  			
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуска";
	СерияОтпуска.Цвет = WebЦвета.СероСиний;
	
	СерияПродолжительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияПродолжительногоОтпуска.Текст = "Отпуск с продолжительностью более 28 дней";
	СерияПродолжительногоОтпуска.Цвет = WebЦвета.Коралловый;
	
	Для Каждого Строка Из ГрафикОтпусков Цикл  		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);

		Если Строка.ОбщаяПродолжительностьОтпуска > 28 Тогда 			
			Серия = СерияПродолжительногоОтпуска;		
		Иначе     		
			Серия = СерияОтпуска;
		КонецЕсли;  
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);  
		
	КонецЦикла;	
	
КонецПроцедуры  

#КонецОбласти
